const maleNames = {
    'А': ['Адам', 'Андрій','Артем'],
    'Б': ['Біломир', 'Богдан','Борис'],
    'В': ['Валентин', 'Віталій','Віктор'],
    'Г': ['Георгій', 'Гліб','Григорій'],
    'Д': ['Давид', 'Денис','Домінік'],
    'Є': ['Єремій', 'Єгор','Євген'],
    'Ж': ['Жадан', 'Ждан','Життєлюб'],
    'З': ['Захар', 'Зорян','Звенигор,'],
    'І': ['Іван', 'Ігор','Ілля'],
    'К': ['Кузьма', 'Кирило','Костянтин'],
    'Л': ['Лев', 'Леонід','Любомир'],
    'М': ['Максим', 'Матвій','Микола'],
    'Н': ['Нестор', 'Назарій','Наслав'],
    'О': ['Олег', 'Олесь','Орест'],
    'П': ['Павло', 'Пересвіт','Потап'],
    'Р': ['Радко', 'Радомир','Роман'],
    'С': ['Святослав', 'Семен','Стожар'],
    'Т': ['Тарас', 'Тимур','Троян'],
    'У': ['Устим'],
    'Ф': ['Федір', 'Фауст'],
    'Х': ['Хорив', 'Христофор'],
    'Ц': ['Царко', 'Цвітан'],
    'Ч': ['Честислав'],
    'Щ': ['Щастибог', 'Щастислав'],
    'Ю': ['Юліан', 'Юлій','Юрій'],
    'Я': ['Яволод', 'Ярополк','Ярош'],
}

const femaleNames = {
    'А': ['Анастасія', 'Аделаїда','Антоніна'],
    'Б': ['Бажана', 'Богуслава','Богдана'],
    'В': ['Валерія', 'Вероніка','Всеслава'],
    'Г': ['Галина', 'Ганна','Гафія'],
    'Д': ['Дарина', 'Дорофея','Діна'],
    'Е': ['Евеліна', 'Едіта','Елла'],
    'Є': ['Євдокія', 'Євгенія','Єва'],
    'Ж': ['Жадана', 'Жанна','Жозефіна'],
    'З': ['Зінаїда', 'Златомира','Зоряна,'],
    'І': ['Іванна', 'Іларія','Ірина'],
    'Й': ['Йовілла', 'Йосипа,','Йосифата'],
    'К': ['Катерина', 'Квітослава','Кароліна'],
    'Л': ['Леся', 'Ліна','Любов'],
    'М': ['Магдалина', 'Маргарита','Марія'],
    'Н': ['Надія', 'Наталія','Ніна'],
    'О': ['Олена', 'Орися','Ольга'],
    'П': ['Поліна', 'Перемисла','Пелагія'],
    'Р': ['Раїна', 'Роксана','Руслана'],
    'С': ['Світлана', 'Слава','Соломія'],
    'Т': ['Таїсія', 'Тамара','Тетяна'],
    'У': ['Улита', 'Уляна','Устина'],
    'Ф': ['Фаїна', 'Фотина','Фекла'],
    'Х': ['Христина', 'Хівря','Харитина'],
    'Ц': ['Цецілія', 'Цвітана'],
    'Ч': ['Чеслава'],
    'Ю': ['Юстина', 'Юхимія','Юлина'],
    'Я': ['Яніна', 'Яромира','Яніна'],
}

const surnameMale = {
    'А': ['Абрамчук', 'Авдєєв,','Азімов'],
    'Б': ['Бабанін', 'Барщевський','Баранов'],
    'В': ['Воронін', 'Ворошило','Волжин'],
    'Г': ['Гавриленко', 'Газаров','Гайдуков'],
    'Д': ['Давидов', 'Дорошкевич','Давиденко'],
    'Е': ['Ерстенюк', 'Екстрем','Евенсон'],
    'Є': ['Ємченко', 'Єсипов','Ємцов'],
    'Ж': ['Жаданівський', 'Жиденко','Жмакін'],
    'З': ['Задорожний', 'Запорожан','Заяць'],
    'І': ['Іванченко','Ісламов','Іллічов'],
    'К': ['Калиненко','Канішевський','Касимов'],
    'Л': ['Лагодинський', 'Латинін','Лебединський'],
    'М': ['Мазур', 'Маліцький','Мамін'],
    'Н': ['Наливайко', 'Неплюєв','Нємцов'],
    'О': ['Олесь', 'Осадчий','Осташевський'],
    'П': ['Павлов', 'Погрібняк','Піскарьов'],
    'Р': ['Равський', 'Рижков','Рудко'],
    'С': ['Савенко', 'Самойлов','Семеняк'],
    'Т': ['Тарасенко','Тупицький','Тихомиров'],
    'У': ['Усач','Устинов','Уткін'],
    'Ф': ['Фам', 'Федоров','Фісун'],
    'Х': ['Хименко', 'Хлевнюк','Холоденко'],
    'Ц': ['Цапко', 'Циганков','Цвітан'],
    'Ч': ['Чепелюк','Чернишов','Чумак'],
    'Ш': ['Шаронов','Шебеко','Шумило'],
    'Щ': ['Щербак','Щербина','Щуренко'],
    'Ю': ['Юденко', 'Юрак','Юхнович'],
    'Я': ['Яблуновський', 'Яковина','Яловий'],
}

const surnameFemale = {
    'А': ['Абрамчук', 'Авдєєва,','Азімова'],
    'Б': ['Бабаніна', 'Барщевська','Баранова'],
    'В': ['Вороніна', 'Ворошило','Волжина'],
    'Г': ['Гавриленко', 'Газарова','Гайдукова'],
    'Д': ['Давидова', 'Дорошкевич','Давиденко'],
    'Е': ['Ерстенюк', 'Екстрем','Евенсон'],
    'Є': ['Ємченко', 'Єсипова','Ємцова'],
    'Ж': ['Жаданівська', 'Жиденко','Жмакіна'],
    'З': ['Задорожна', 'Запорожан','Заяць'],
    'І': ['Іванченко', 'Ісламова','Іллічова'],
    'К': ['Калиненко', 'Канішевська','Касимова'],
    'Л': ['Лагодинська', 'Латиніна','Лебединська'],
    'М': ['Мазур', 'Маліцька','Маміна'],
    'Н': ['Наливайко', 'Неплюєва','Нємцова'],
    'О': ['Олесь', 'Осадча','Осташевська'],
    'П': ['Павлова', 'Погрібняк','Піскарьова'],
    'Р': ['Равська', 'Рижкова','Рудко'],
    'С': ['Савенко', 'Самойлова','Семеняк'],
    'Т': ['Тарасенко', 'Тупицька','Тихомирова'],
    'У': ['Усач','Устинова','Уткіна'],
    'Ф': ['Фам', 'Федорова','Фісун'],
    'Х': ['Хименко', 'Хлевнюк','Холоденко'],
    'Ц': ['Цапко', 'Циганкова','Цвітан'],
    'Ч': ['Чепелюк','Чернишова','Чумак'],
    'Ш': ['Шаронова','Шебеко','Шумило'],
    'Щ': ['Щербак','Щербина','Щуренко'],
    'Ю': ['Юденко', 'Юрак','Юхнович'],
    'Я': ['Яблуновська', 'Яковина','Ялова'],
}
let nameLatter = prompt('введіть першу букву імені')
let surnameLatter = prompt('Введіть першу букву прізвища')
let gender = prompt('Введіть male якщо ви хочете щоб вивелись данні для чоловіка та  female якщо для жінки ')
let result = ''

if ((nameLatter === Number)  && (surnameLatter === Number) ) {
    alert('Введіть букву')
}else if(gender === 'male') {
    result = generateName(nameLatter, surnameLatter,maleNames, surnameMale)
}else if (gender === 'female') {
    result= generateName(nameLatter, surnameLatter,femaleNames,surnameFemale)
}


console.log(result)
function generateName ( nameLatter, surnameLater, nameArray, surnameArray) {

    let name = getStringByLetter(nameLatter,nameArray)
    let surname = getStringByLetter(surnameLater,surnameArray)
    return name + ' ' + surname
}

function getStringByLetter (letter, array) {
    let arr = array[letter]
    let name = arr[Math.floor(Math.random() * (arr.length - 1))]
    return name
}

